group-reports/shahriar-1-2-tests/first-results/disk-throughput-tuning-protocol-B-sndbuf-2k/test-2.txt
write-sequentially-test-job: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
write-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

write-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=456: Sat Jul  8 15:04:45 2023
  write: IOPS=2, BW=8729KiB/s (8938kB/s)(5184MiB/608154msec)
    slat (usec): min=130, max=19260, avg=666.63, stdev=1471.81
    clat (msec): min=1045, max=14275, avg=7499.06, stdev=980.52
     lat (msec): min=1050, max=14275, avg=7499.73, stdev=980.49
    clat percentiles (msec):
     |  1.00th=[ 5537],  5.00th=[ 6141], 10.00th=[ 6409], 20.00th=[ 6812],
     | 30.00th=[ 7013], 40.00th=[ 7282], 50.00th=[ 7483], 60.00th=[ 7684],
     | 70.00th=[ 7886], 80.00th=[ 8221], 90.00th=[ 8557], 95.00th=[ 8926],
     | 99.00th=[ 9597], 99.50th=[11879], 99.90th=[13892], 99.95th=[14295],
     | 99.99th=[14295]
   bw (  KiB/s): min= 7742, max=40960, per=100.00%, avg=10144.53, stdev=3848.78, samples=1033
   iops        : min=    1, max=   10, avg= 2.18, stdev= 1.03, samples=1033
  cpu          : usr=0.29%, sys=0.08%, ctx=1323, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=0.6%, 16=98.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1296,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=8729KiB/s (8938kB/s), 8729KiB/s-8729KiB/s (8938kB/s-8938kB/s), io=5184MiB (5436MB), run=608154-608154msec

Disk stats (read/write):
    drbd1: ios=0/6515, merge=0/0, ticks=0/47297482, in_queue=47297482, util=99.53%, aggrios=0/6538, aggrmerge=0/0, aggrticks=0/363158, aggrin_queue=363158, aggrutil=8.34%
    dm-0: ios=0/6538, merge=0/0, ticks=0/363158, in_queue=363158, util=8.34%, aggrios=0/6535, aggrmerge=0/3, aggrticks=0/363341, aggrin_queue=360060, aggrutil=8.34%
  vdb: ios=0/6535, merge=0/3, ticks=0/363341, in_queue=360060, util=8.34%